## SQL - Date Time Analysis
    Date & Time Analysis in SQL refers to working with temporal data to ::
    - Store dates and timestamps
    - Extract parts of dates
    - Perform calculations between dates
    - Filter records by time periods
    - Analyze trends over time (daily, monthly, yearly)

### Common Date/Time Data Types
    | Data Type   |          Description                 |
    | ----------- | ------------------------------------ |
    |  DATE       | Stores date only (YYYY-MM-DD)        |
    |  TIME       | Stores time only (HH:MM:SS)          |
    |  DATETIME   | Stores date + time                   |
    |  TIMESTAMP  | Date + time with timezone handling   |
    |  INTERVAL   | Duration (days, months, years, etc.) |

### Database Connection

In [11]:
%reload_ext sql
%config SqlMagic.style = '_DEPRECATED_DEFAULT'
%sql mysql+pymysql://root:@localhost/test

In [15]:
%%sql
SELECT version();

 * mysql+pymysql://root:***@localhost/test
1 rows affected.

[('10.4.32-MariaDB',)]

### Create Table order

In [20]:
%%sql
CREATE TABLE orders (
    order_id INT PRIMARY KEY,
    customer_name VARCHAR(50),
    order_date DATE,
    order_time TIME,
    order_datetime DATETIME,
    delivery_date DATE,
    sales DECIMAL(10,2)
);

 * mysql+pymysql://root:***@localhost/test
0 rows affected.

[]

### Insert data

In [23]:
%%sql
INSERT INTO orders VALUES
(101, 'Amit',   '2024-01-01', '09:15:00', '2024-01-01 09:15:00', '2024-01-05', 1200),
(102, 'Neha',   '2024-01-03', '14:30:00', '2024-01-03 14:30:00', '2024-01-06', 1800),
(103, 'Rahul',  '2024-01-07', '11:45:00', '2024-01-07 11:45:00', '2024-01-12', 1500),
(104, 'Sneha',  '2024-02-01', '16:10:00', '2024-02-01 16:10:00', '2024-02-04', 2200),
(105, 'Ravi',   '2024-02-10', '10:00:00', '2024-02-10 10:00:00', '2024-02-15', 1700),
(106, 'Priya',  '2024-03-05', '13:20:00', '2024-03-05 13:20:00', '2024-03-08', 2500),
(107, 'Kunal',  '2024-03-18', '18:45:00', '2024-03-18 18:45:00', '2024-03-22', 3000),
(108, 'Anita',  '2024-03-31', '08:50:00', '2024-03-31 08:50:00', '2024-04-03', 2800),
(109, 'Vikas',  '2024-04-02', '20:10:00', '2024-04-02 20:10:00', '2024-04-06', 3200),
(110, 'Pooja',  '2024-04-15', '12:00:00', '2024-04-15 12:00:00', '2024-04-20', 2100);

 * mysql+pymysql://root:***@localhost/test
10 rows affected.

[]

In [51]:
%%sql
select * from orders;

 * mysql+pymysql://root:***@localhost/test
10 rows affected.

[(101, 'Amit', datetime.date(2024, 1, 1), datetime.timedelta(seconds=33300), datetime.datetime(2024, 1, 1, 9, 15), datetime.date(2024, 1, 5), Decimal('1200.00')),
 (102, 'Neha', datetime.date(2024, 1, 3), datetime.timedelta(seconds=52200), datetime.datetime(2024, 1, 3, 14, 30), datetime.date(2024, 1, 6), Decimal('1800.00')),
 (103, 'Rahul', datetime.date(2024, 1, 7), datetime.timedelta(seconds=42300), datetime.datetime(2024, 1, 7, 11, 45), datetime.date(2024, 1, 12), Decimal('1500.00')),
 (104, 'Sneha', datetime.date(2024, 2, 1), datetime.timedelta(seconds=58200), datetime.datetime(2024, 2, 1, 16, 10), datetime.date(2024, 2, 4), Decimal('2200.00')),
 (105, 'Ravi', datetime.date(2024, 2, 10), datetime.timedelta(seconds=36000), datetime.datetime(2024, 2, 10, 10, 0), datetime.date(2024, 2, 15), Decimal('1700.00')),
 (106, 'Priya', datetime.date(2024, 3, 5), datetime.timedelta(seconds=48000), datetime.datetime(2024, 3, 5, 13, 20), datetime.date(2024, 3, 8), Decimal('2500.00')),
 (107, 'Kunal', datetime.date(2024, 3, 18), datetime.timedelta(seconds=67500), datetime.datetime(2024, 3, 18, 18, 45), datetime.date(2024, 3, 22), Decimal('3000.00')),
 (108, 'Anita', datetime.date(2024, 3, 31), datetime.timedelta(seconds=31800), datetime.datetime(2024, 3, 31, 8, 50), datetime.date(2024, 4, 3), Decimal('2800.00')),
 (109, 'Vikas', datetime.date(2024, 4, 2), datetime.timedelta(seconds=72600), datetime.datetime(2024, 4, 2, 20, 10), datetime.date(2024, 4, 6), Decimal('3200.00')),
 (110, 'Pooja', datetime.date(2024, 4, 15), datetime.timedelta(seconds=43200), datetime.datetime(2024, 4, 15, 12, 0), datetime.date(2024, 4, 20), Decimal('2100.00'))]

### Extract year, month, day, and day name for each order from order_date

In [55]:
%%sql
select order_id,
                year(order_date) as year,
                month(order_date) as month,
                day(order_date) as day,
                dayname(order_date) as day_name
from orders
limit 4;

 * mysql+pymysql://root:***@localhost/test
4 rows affected.

[(101, 2024, 1, 1, 'Monday'),
 (102, 2024, 1, 3, 'Wednesday'),
 (103, 2024, 1, 7, 'Sunday'),
 (104, 2024, 2, 1, 'Thursday')]

### Extract hour and minute from order_datetime

In [42]:
%%sql
select order_id,
                hour(order_time) as hour,
                minute(order_time) as minute
from orders
limit 4;

 * mysql+pymysql://root:***@localhost/test
4 rows affected.

[(101, 9, 15), (102, 14, 30), (103, 11, 45), (104, 16, 10)]

## Orders placed in February 2024

In [58]:
%%sql
select * from orders
where year(order_date) = 2024 and month(order_date) = 2;

 * mysql+pymysql://root:***@localhost/test
2 rows affected.

[(104, 'Sneha', datetime.date(2024, 2, 1), datetime.timedelta(seconds=58200), datetime.datetime(2024, 2, 1, 16, 10), datetime.date(2024, 2, 4), Decimal('2200.00')),
 (105, 'Ravi', datetime.date(2024, 2, 10), datetime.timedelta(seconds=36000), datetime.datetime(2024, 2, 10, 10, 0), datetime.date(2024, 2, 15), Decimal('1700.00'))]

### Orders placed between 2024-03-01 and 2024-03-31

In [63]:
%%sql
select * from orders
where order_date between '2024-03-01' and '2024-03-31';

 * mysql+pymysql://root:***@localhost/test
3 rows affected.

[(106, 'Priya', datetime.date(2024, 3, 5), datetime.timedelta(seconds=48000), datetime.datetime(2024, 3, 5, 13, 20), datetime.date(2024, 3, 8), Decimal('2500.00')),
 (107, 'Kunal', datetime.date(2024, 3, 18), datetime.timedelta(seconds=67500), datetime.datetime(2024, 3, 18, 18, 45), datetime.date(2024, 3, 22), Decimal('3000.00')),
 (108, 'Anita', datetime.date(2024, 3, 31), datetime.timedelta(seconds=31800), datetime.datetime(2024, 3, 31, 8, 50), datetime.date(2024, 4, 3), Decimal('2800.00'))]

### Orders placed on weekends

In [70]:
%%sql
select order_id, order_date, dayname(order_date) as day_name
from orders
where dayofweek(order_date) in (1,7)

 * mysql+pymysql://root:***@localhost/test
3 rows affected.

[(103, datetime.date(2024, 1, 7), 'Sunday'),
 (105, datetime.date(2024, 2, 10), 'Saturday'),
 (108, datetime.date(2024, 3, 31), 'Sunday')]

### Calculate from order date delivery days

In [77]:
%%sql
SELECT order_id, order_date, delivery_date, 
    DATEDIFF(delivery_date, order_date) AS delivery_days
FROM orders
limit 4;

 * mysql+pymysql://root:***@localhost/test
4 rows affected.

[(101, datetime.date(2024, 1, 1), datetime.date(2024, 1, 5), 4),
 (102, datetime.date(2024, 1, 3), datetime.date(2024, 1, 6), 3),
 (103, datetime.date(2024, 1, 7), datetime.date(2024, 1, 12), 5),
 (104, datetime.date(2024, 2, 1), datetime.date(2024, 2, 4), 3)]

### Orders where delivery took more than 4 days

In [84]:
%%sql
SELECT order_id, order_date, delivery_date, 
    DATEDIFF(delivery_date, order_date) AS delivery_days
FROM orders
where DATEDIFF(delivery_date, order_date) > 4;

 * mysql+pymysql://root:***@localhost/test
3 rows affected.

[(103, datetime.date(2024, 1, 7), datetime.date(2024, 1, 12), 5),
 (105, datetime.date(2024, 2, 10), datetime.date(2024, 2, 15), 5),
 (110, datetime.date(2024, 4, 15), datetime.date(2024, 4, 20), 5)]

### Add 7 days to order_date

In [91]:
%%sql
select order_id, order_date,
           date_add(order_date, interval  7 day) as followed_up_date
from orders
limit 4;

 * mysql+pymysql://root:***@localhost/test
4 rows affected.

[(101, datetime.date(2024, 1, 1), datetime.date(2024, 1, 8)),
 (102, datetime.date(2024, 1, 3), datetime.date(2024, 1, 10)),
 (103, datetime.date(2024, 1, 7), datetime.date(2024, 1, 14)),
 (104, datetime.date(2024, 2, 1), datetime.date(2024, 2, 8))]

### Monthly total sales and Average sales per month

In [102]:
%%sql
select
        year(order_date) as year,
        month(order_date) as month,
        sum(sales) as total_monthly_sales,
        avg(sales) as Avg_monthly_sales
from orders
group by  year(order_date), month(order_date)  ;

 * mysql+pymysql://root:***@localhost/test
4 rows affected.

[(2024, 1, Decimal('4500.00'), Decimal('1500.000000')),
 (2024, 2, Decimal('3900.00'), Decimal('1950.000000')),
 (2024, 3, Decimal('8300.00'), Decimal('2766.666667')),
 (2024, 4, Decimal('5300.00'), Decimal('2650.000000'))]

### First and last order date

In [105]:
%%sql
SELECT
    MIN(order_date) AS first_order,
    MAX(order_date) AS last_order
FROM orders;

 * mysql+pymysql://root:***@localhost/test
1 rows affected.

[(datetime.date(2024, 1, 1), datetime.date(2024, 4, 15))]

### Compare current sales with previous order sales

In [108]:
%%sql
SELECT
    order_date,
    sales,
    LAG(sales) OVER (ORDER BY order_date) AS previous_sales
FROM orders;

 * mysql+pymysql://root:***@localhost/test
10 rows affected.

[(datetime.date(2024, 1, 1), Decimal('1200.00'), None),
 (datetime.date(2024, 1, 3), Decimal('1800.00'), Decimal('1200.00')),
 (datetime.date(2024, 1, 7), Decimal('1500.00'), Decimal('1800.00')),
 (datetime.date(2024, 2, 1), Decimal('2200.00'), Decimal('1500.00')),
 (datetime.date(2024, 2, 10), Decimal('1700.00'), Decimal('2200.00')),
 (datetime.date(2024, 3, 5), Decimal('2500.00'), Decimal('1700.00')),
 (datetime.date(2024, 3, 18), Decimal('3000.00'), Decimal('2500.00')),
 (datetime.date(2024, 3, 31), Decimal('2800.00'), Decimal('3000.00')),
 (datetime.date(2024, 4, 2), Decimal('3200.00'), Decimal('2800.00')),
 (datetime.date(2024, 4, 15), Decimal('2100.00'), Decimal('3200.00'))]

### Rank orders based on order_date

In [113]:
%%sql
select order_id, order_date,
       rank() over(order by order_date) order_rank
from orders;

 * mysql+pymysql://root:***@localhost/test
10 rows affected.

[(101, datetime.date(2024, 1, 1), 1),
 (102, datetime.date(2024, 1, 3), 2),
 (103, datetime.date(2024, 1, 7), 3),
 (104, datetime.date(2024, 2, 1), 4),
 (105, datetime.date(2024, 2, 10), 5),
 (106, datetime.date(2024, 3, 5), 6),
 (107, datetime.date(2024, 3, 18), 7),
 (108, datetime.date(2024, 3, 31), 8),
 (109, datetime.date(2024, 4, 2), 9),
 (110, datetime.date(2024, 4, 15), 10)]

### Classify orders as Weekday / Weekend

In [124]:
%%sql
select order_id, order_date, dayname(order_date) as day_name,
                                case 
                                      when dayofweek(order_date) in (1,7) then "Weekend"
                                      else "Weekday"
                                end as order_category
from orders

 * mysql+pymysql://root:***@localhost/test
10 rows affected.

[(101, datetime.date(2024, 1, 1), 'Monday', 'Weekday'),
 (102, datetime.date(2024, 1, 3), 'Wednesday', 'Weekday'),
 (103, datetime.date(2024, 1, 7), 'Sunday', 'Weekend'),
 (104, datetime.date(2024, 2, 1), 'Thursday', 'Weekday'),
 (105, datetime.date(2024, 2, 10), 'Saturday', 'Weekend'),
 (106, datetime.date(2024, 3, 5), 'Tuesday', 'Weekday'),
 (107, datetime.date(2024, 3, 18), 'Monday', 'Weekday'),
 (108, datetime.date(2024, 3, 31), 'Sunday', 'Weekend'),
 (109, datetime.date(2024, 4, 2), 'Tuesday', 'Weekday'),
 (110, datetime.date(2024, 4, 15), 'Monday', 'Weekday')]

### Find month-end orders

In [127]:
%%sql
SELECT *
FROM orders
WHERE order_date = LAST_DAY(order_date);

 * mysql+pymysql://root:***@localhost/test
1 rows affected.

[(108, 'Anita', datetime.date(2024, 3, 31), datetime.timedelta(seconds=31800), datetime.datetime(2024, 3, 31, 8, 50), datetime.date(2024, 4, 3), Decimal('2800.00'))]